{"content":[{"index":0,"type":"text","contents":"today, i want to talk about Animal Crossing: New Leaf"},{"index":1,"type":"text","contents":"why? because i fucking love the game and this is my blog, god damn it, so you'll sit here and read and you'll LIKE IT (or you'll click off the site and find something infinitely more entertaining, for which i cannot blame you)"},{"index":3,"type":"pic","contents":"32bd8f0f-7824-4f31-9785-b519c3412a01.JPG"},{"index":3,"type":"text","contents":"(Picture taken January First, 2017. Over eight years ago. *Shudder*) "},{"index":4,"type":"text","contents":"My first memories of Animal Crossing as a series go back to the late 2000s, early 2010s. My sister and I came from a family that wasn't incredibly well off, we only got a couple of games a year and so we always had to decide together on what games we would get. Christmas meant we would share a game. Birthdays, we'd have a bit more selection because we chose individually, but this meant we equally had the choice not to ask for a Wii game. Needless to say, getting a new game meant spending a large chunk of what small precious amounts we had, so the name of the game was: CONVINCING."},{"index":5,"type":"text","contents":"My sister is four years older than me, and thus she was granted internet access. I can only assume this, along with word of mouth from public school (I was homeschooled, myself), was what led her to find what games she'd beg me to ask for, or spend a great deal of my saved allowance on (we'd often go halves to get a game we could share, in the summers). One such game was Super Paper Mario, which we both got a great deal of enjoyment out of. Another was the Wall-E movie-game (practically shovelware, as I recall)... And another, was Animal Crossing: City Folk."},{"index":6,"type":"pic","contents":"468d8803-8ff2-4cf5-9cf2-04e6d33f0ca2.jpg"},{"index":7,"type":"text","contents":"My sister had heard about the Animal Crossing series from our mutual friend Sam, who had showed her Wild World for the DS (which I've never done a full playthrough of, but I've heard is vastly superior). At first, I wasn't very interested, I thought it looked boring and 'girly' (oh the irony), and I was transfixed on other games at the time, though what they were I've now got no clue. Either way, somehow she CONVINCED me to put my pocket money towards picking this up from, I believe, our local Target, and later that day we got home and started playing. "},{"index":8,"type":"text","contents":"I believe it was sometime in March or April that we first picked it up, or maybe it was May, just before the summer months came in. We named our town Polperro, after the small fishing village wherein the british side of our family resided (and where my family now lives). I watched her play for a while, then when she was done I made my character, went about my business, worked for that infamous tanuki and became acquainted with the gameplay of Animal Crossing, and the minimal, understated nature pertained to it. "},{"index":9,"type":"text","contents":"Once we both understood how the game functioned, and what your goal was - I.E., there isn't really a goal, you just check in and log a little time day by day, seeing what's new, what's changed, what remains the same... We both became hooked. "},{"index":10,"type":"text","contents":"Perhaps we didn't play it every single day (we were both very entertained by Mario Kart, NSMBW, Brawl, and a plethora of other games), but every time we checked in on our little village we found ourselves once more immersed in and enamored with this little friendly world inside our TV. We grew very attached to quite a few villagers - I remember us both loving the frog, Prince, the elephant Margie... and hating Whitney the Wolf and Angus the Cow (see below: rude villagers). One day, my sister shouted to me while I was downstairs, saying to come look at what's going on. Turns out Prince, who had moved out a while back, was present in the City, and as I recall - though my memory may fail me here, not sure if this is a feature or I'm mistaking NL for CF - he recognized my sister's character as well. I wasn't overly interested, though. I'm pretty sure a few years later in New Leaf, Prince moved into my town, I showed my sister and she wasn't interested at all. In fact, I don't think she remembered who Prince was, really. Haha."},{"index":11,"type":"text","contents":"I can still remember the excitement of summer vacation, the warm glow of the CRT glimmering on the other end of the bedroom, staying up late just to find out what different kinds of bugs and fish would show up... being scared shitless by the fucking tarantulas and scorpions (lol). "},{"index":12,"type":"text","contents":"I don't have any distinct memories of seeing seasonal events, I don't think we played much around Halloween or Christmas - once I got into Nintendo games I started obsessing over The Legend of Zelda and didn't really stop (I'll write about that in future, I'm sure). That being said, my sister and I both adored this fun little romp, and seeing the seasons change, the reflections of it in the weather - snow falling, leaves decaying, sun shining... It was enchanting. "},{"index":13,"type":"pic","contents":"8ddd0ff1-8081-4b9a-9361-dd1f8ffc4a9d.png"},{"index":14,"type":"text","contents":"(I seem to remember being absolutely convinced that the weather in-game was hooked up to whatever town name you chose. As in, if you named your town after a real place, it would search the internet, check the weather for that place, and have it reflect in game. Of course, when we went to check the Polperro weather online and saw it was rainy there but sunny in game, this was disproven... lol)"},{"index":15,"type":"text","contents":"City Folk was a humble game - as I said before, understated, minimal. I didn't particularly notice what most complain about - 'lobotomized villagers' - in fact, my sister and I found some characters rude, and even downright mean at times, to the degree that we wished for them to move out, and pulled the classic move of hitting them with a net over and over until they became pissed off. By all accounts, to my sister and I, AC:CF was a perfect introduction to the franchise. "},{"index":16,"type":"pic","contents":"53534c35-a4db-43aa-990d-387a98391728.jpg"},{"index":17,"type":"text","contents":"(On the one hand, there's a couple of rude quotes in here. It's easy to understand why my sister and I may have thought Whitney and Angus were dicks. On the other hand...)"},{"index":18,"type":"pic","contents":"bf9d7d25-c53d-44d7-97a7-0c917e3e76cf.jpg"},{"index":19,"type":"pic","contents":"677391e6-e28a-43fa-96ee-d262e3750167.jpg"},{"index":20,"type":"text","contents":"(Yeah, alright, maybe villagers had a bit more 'soul' in the past.)"},{"index":21,"type":"text","contents":"The years went by, and City Folk became somewhat of a fading memory. I eventually procured a 3DS and a Nintendo 64, and found myself far more entertained by those two things in addition to PC gaming, as opposed to the Wii (though friends and I still enjoyed the occasional romp in Mario Kart or Brawl)."},{"index":22,"type":"text","contents":"Then, I started hearing rumors and inklings about a new Animal Crossing game, this time on the Nintendo 3DS, and my intrigue grew, and grew, and grew some more, until finally in the summer of 2013 - the most hellish summer I can think of for a multitude of reasons - Animal Crossing: New Leaf was released in the west and I picked it up very soon after."},{"index":23,"type":"text","contents":"I seem to remember falling in love with the game as soon as I played it - the concept of being a mayor and designing the town wasn't as exciting to me as getting all of the little nintendo reference items from fortune cookies acquired from playcoins. I wanted to be Link (at the time I was still infatuated with Skyward Sword...) so I ran around with my 3DS a bunch to try and get as many playcoins as I could. I went bugcatching on the island, too! In fact, I can remember my first time learning this trick..."},{"index":24,"type":"text","contents":"My earliest distinct memory of playing New Leaf was either on or somewhere around July 4th, 2013. I was sat in the back of my dad's truck with my Mom (I think my sister was away somewhere). We were watching a fireworks show that was put on by our local Baseball stadium - the Five County Stadium, or Carolina mudcats stadium."},{"index":25,"type":"pic","contents":"b418be75-29d3-453d-8474-60037126563c.jpg"},{"index":26,"type":"text","contents":"(Speaking of the Mudcats Stadium - AKA the Five County Stadium in Zebulon - I found this lunchbox in a thrift store near Aurora, CO. For context, this stadium was, I shit you not, 15 minutes from my house in Wendell, NC, where I grew up. I checked on Google maps, a 15 minute drive. There it was, sat in a glass case thousands of miles from NC, years after I'd lived in NC. I couldn't believe my fucking eyes. The universe is weirdly coincidental like that. This lunchbox probably isn't all that sentimental or interesting to anyone else, but to me it was a hallmark of absolute cosmic insanity, considering how many times I'd gone to the stadium from which this lunchbox originated over the summers spent in NC.)"},{"index":27,"type":"text","contents":"We were parked at a nearby lot where the fireworks were clearly visible, just over the creeping peaks of the monolithic pine trees that produced so much pollen in spring, the skies would turn yellow - as would everything else. Something something, Coldplay. Anyway, earlier that day I had seen an IGN tutorial on how to make good money, and I learned the infamous beetle-hunting tactic on Tortimer's Tropical Island. I was employing this very tactic while we all waited for the show to start, carefully creeping up on the beetles to make a nice stack of bells to bring back with me. Why does this memory stick out in my mind? I attribute it to one thing, mainly - Summer 2013 was when my parents broke up. (WAIT! You're telling me this DEPRESSIVE BREAKCORE 'ARTIST'... comes from a BROKEN HOME?!)"},{"index":28,"type":"text","contents":"Maybe it's cliche and cheesy to talk about how 'video games were there for us when nobody else was', but for the love of God, my world was falling apart. We used to visit Cornwall, in GB, every couple of years (eventually, every year, due to the declining health of my mother's parents), and throughout my whole life of visiting this little fishing village I told myself over and again, I love it there, but I'd never want to live there. Of course, the only community my mother had known in the states now rejected her entirely because she wished to divorce my father, and wasn't committing to living another minute of hell on earth with him despite their 'bond of holy matrimony'. Her faith was being tried by those around her because she had the agency a woman needs to defend her family. Well, God forbid! (literally!)"},{"index":29,"type":"text","contents":"She broke the news to me in June of 2013, after coming back from a brief visit to help with her father's funeral (the details surrounding his death are messy and depressing and ultimately I don't want to make them public on here). I cried and cried, and begged her to promise me that we wouldn't move to England. Well, she broke that promise, so I promised her she'd let me move back after a year. She broke that promise too, because my dad was just getting worse. There was a time I wanted to move back with him because I missed the states so much - it got to the point, eventually, where I booked the plane tickets and had my bags packed... then the day came to fly out and something inside me told me I couldn't do it, and so I didn't, and I'll never forget the disappointment in my father's voice on the phone thereafter."},{"index":30,"type":"text","contents":"But it was that month, June, that I picked up New Leaf and started playing it. I don't really remember what compelled me to purchase it. I think part of me had an idea in mind that it would be nice to check in on my little clique day-in day-out. Subconsciously, I suppose there was some element of stability within the game that helped keep my adolsecent sanity in check during a time of what seemed like unending turmoil. "},{"index":31,"type":"text","contents":"Early July, I was resigned to the fate of moving to the UK. I was resigned to the fact that I would lose my american friends. In some ways, it felt as though I was losing them already, because I was embracing a side of me I'd known had always been there - my femininity - and I don't think my local protestant stiff-upper-lipped good-boy friends liked it all that much. Maybe I spent too much time online, though. I don't know. "},{"index":32,"type":"text","contents":"Early July, I played AC:NL, and I felt the warm Carolina sun on my skin, and I began to feel the last remaining hints of childhood innocence fade as I became a pre-teen. Still, what childhood remained now makes those memories of playing the game when it first came out at a massive turning point in my life (perhaps... a new leaf?!) tinted a wonderful rosy red. That memory of hunting for golden stag beetles in the back of my dad's truck on my purple 3DS will stick with me for forever, I think. "},{"index":33,"type":"pic","contents":"e8c82a49-ea4c-4360-adb5-6b4deb5107b9.png"},{"index":34,"type":"text","contents":"My early memories of the game are a summery haze. I soon moved to the dreaded UK and grew bored of my 3DS, instead spending my time playing Minecraft and watching South Park and taking the death of my innocence into my own hands with unrestricted and unlimited internet access. "},{"index":35,"type":"text","contents":"Years went by and once again, Animal Crossing became somewhat of a fading memory. Then, I met someone on the Darkly trade servers in TF2 called Jewel Princess (Shiew-Mei Tan). We became fast friends and she spoke to me of how she loved Animal Crossing, and I shared a similarly fond sentiment. Eventually, we ended up playing it together, and she gifted me a bunch of stuff, including most (if not all) of the Zelda DLC items you could get from the Amiibo and Fortune Cookies. I believe this was on my original save of Animal Crossing, because I remember eventually trading all of the items she had gifted me to my girlfriend at the time in order to start a new save. That being said, it's also a complete possibility that I had started a new save before she traded me anything, I don't remember very clearly what happened to my original save on New Leaf. I know eventually I started a new town around the time of the Welcome Amiibo update, but that was because I had purchased a New Nintendo 3DS XL (in order to play Majora's Mask 3D, for which I'd been waiting years. What a disappointment that was... and Pokemon Sun and Moon which came soon after...) What became of that save, that town? My girlfriend overwrote it to make her own character, and then a couple years the same would happen once more with a boyfriend I had. "},{"index":36,"type":"text","contents":"This girlfriend who had initially overwritten the aforementioned save, I only came to know because of our shared interested in Animal Crossing. She had a shirt on that said “AntiSocial: No Life” in the style of the Animal Crossing: New Leaf logo, and I commented on it, and how I loved Animal Crossing, and she gave me a big hug. We soon became friends, and that led on to other things that were ultimately terrible, but I'm not going to detail that here because I'd rather not spill any traumas right now, I've done that enough for one blog. "},{"index":37,"type":"text","contents":"I played and played and did more and more with my town over summer in 2016, but was never overly happy with my save, which was why I allowed my girlfriend to overwrite it when we got together. However, while my obsession began to grow with Animal Crossing once more, another passion grew parallel - my reignited pasison for music."},{"index":38,"type":"text","contents":"I've mentioned before on this site my love of music (obviously), and where it originates, and where it continued, but for a brief recap: I started learning piano at 6, I grew bored of it (like most of everything) when I moved to the UK (because everything was miserable and boring and sad), I started learning guitar when I was 14 after falling in love with the theme to “The Last of Us”, since then I've wanted music to be the central focus of my entire life. And so, when I was playing Animal Crossing ad nauseum (along with Skyrim and Fallout: New Vegas), I realized just how fucking insanely good the music was. I remembered loving the music in City Folk as a kid, and now that I loved music more than anything I was even more enamoured with the soundtrack than before."},{"index":39,"type":"text","contents":"Some absolute favorites:<br>1AM, 1PM, 8PM, 10PM, 11PM: sombre yet hopeful, contemplative bliss.<br>4AM, 7PM: unsettling, longing yet beautiul anxiety.<br>6AM, 9AM, 12PM, 3PM: playful, upbeat curiosity.<br>8AM, 5PM, 11AM: feel-good fun reflective of the game itself."},{"index":40,"type":"text","contents":"I could talk at length about how fucking incredible this game's soundtrack is, but many have done it before me, and many will yet. Needless to say it is one of my favorite soundtracks ever. I truly believe it successfully captured the emotional spectrum Animal Crossing offers to the player, and is that not precisely what every soundtrack should strive for? Thank you, Manaka Kataoka and Atsuko Asahi. You will be kept forever in my heart, and my memories."},{"index":41,"type":"text","contents":"The game did so much to revolutionize Animal Crossing. It fixed almost all of the issues that had plagued its predecessors (save for 'lobotomized villagers'), while also adding in a bunch of new content that not only captured the essence of what made the prior entries good, but built upon these fundamentals in a spectacular way. "},{"index":42,"type":"text","contents":"New villagers, new stores, more online functionality, new projects, new roles (you're the fucking mayor!), new collectables... The game did so much with so little, considering the hardware on the 3DS. "},{"index":43,"type":"text","contents":"Then, 3 years after launch they say FUCK IT and add a free DLC with a bunch of new content!!! And you can sit and perhaps complain that some of said new content was locked behind paywalls but Nintendo are a business, and that's how businesses function, shitty as it may be."},{"index":44,"type":"pic","contents":"d79b359c-2c64-4acc-968a-3b0750b42a0d.JPG"},{"index":45,"type":"text","contents":"(Taken July 10th, 2016.)"},{"index":46,"type":"text","contents":"The game still means a lot to me. There's a chance (albeit slim) I'll start a new save down the line, but as it stands my town means far too much to me. Each villager I have has been there for going on 5 or 6 years now, and that sense of familiarity and camraderie and rapport isn't something I'm keen to give up. Hell, there's letters that I sent to villagers wherein I ranted of the trauma I was experiencing at the time of building up my little town (I'm being completely serious here, one such letter is me telling myself I'll do better, I'll get out of the mess I'm in, I'll survive... lol). As an inherently sentimental person, I never wish to give any of this up, not one bit. "},{"index":47,"type":"text","contents":"And you know what's great? The 3DS has a camera function! So in the blog that follows this one, I'll show y'all around my little town. Stay tuned!"},{"index":48,"type":"text","contents":"- static.grl"}]}