{"content":[{"index":0,"type":"text","contents":"hello again, everyone"},{"index":1,"type":"text","contents":"it's been a while, really it has. i'm finally back, though, to tell you all about the release of my new album, 'stupid fucking ideas'."},{"index":2,"type":"text","contents":"now what, praytell, are these stupid fucking ideas, i hear you inquire..."},{"index":3,"type":"text","contents":"well, the album is a collection of demos that i don't feel i wish to complete any time soon, and so i figured i would compile them and put them on a record, seeing as though i've done absolutely nothing with static.grl since april."},{"index":4,"type":"text","contents":"as i mentioned in my last blog post, i've been working on an acoustic album. it's almost done, but it's time for me to return to static.grl for a bit and let this album run its course before i finally hammer in those last few nails."},{"index":5,"type":"text","contents":"i think you'll all quite enjoy this record. some of the tracks are very short, others are relatively lengthy, some are just right. it's a real fucking, i don't know, fucking goldilocks album. "},{"index":6,"type":"text","contents":"i haven't much more to say on it other than i love the work!"},{"index":7,"type":"pic","contents":"9330851b-7f0a-4971-9fe6-20d0d4438610.jpg"},{"index":8,"type":"text","contents":"here's a sketch, a self-portrait i did a few years back. i used it for the cover of a new single that's releasing tomorrow called 'the stupidest fucking idea'. super excited for this one to get out there, i like it a lot. i think most will."},{"index":9,"type":"text","contents":"speaking of self-portraits, hey, let's talk quickly about my personal life. why? oh, because uh, a lot has changed. "},{"index":10,"type":"text","contents":"i'm now living in england (kill me) with my beautiful girlfriend. we have a nice little house to ourselves in a backwoods village. it's pleasant, albeit slow. "},{"index":11,"type":"text","contents":"also, as is of course befitting of the average """breakcore""" """""producer""""" (mind the heavy use of quotations please i beg of you), i was recently diagnosed with ADHD, resulting from C-PTSD. i'm not gonna go into the details but i had a real 'megan' moment (from the great film, 'but i'm a cheerleader') and kind of came to the realization that my entire life began to make sense, and i feel a lot more empathy for myself now, more than i ever have. i'm so very thankful for this diagnosis. i'm much more sane than i'd once thought. "},{"index":12,"type":"text","contents":"not much else to report, in regards to my life. things are as they ever were. static muzakk has been doing well on spotify. thank you all for being so dedicated to listening to the bullshit that spews from my copy of Cubase LE AI Elements 13. "},{"index":13,"type":"pic","contents":"ae9b2321-5b93-4e7a-af4a-dbf0a9dda712.png"},{"index":14,"type":"text","contents":"here's the album cover, by the way, of 'stupid fucking ideas'. featuring a jazz cigarette. i wonder who's face that is?"},{"index":15,"type":"text","contents":"good evening to all. i'm going to go for a walk and a smoke."},{"index":16,"type":"text","contents":"- the static gril (i misspelled on purpose. shut up)"}]}