{"content":[{"index":0,"type":"text","contents":"new music! new breakcore, in fact"},{"index":1,"type":"text","contents":"at the end of my last album there was a track that was somewhat of a critique of using anime girls within breakcore, though it was more a critique of a particular individual and lolicons at large (i fucking despise them)"},{"index":2,"type":"text","contents":"yet, here i am using anime as a central theme within my music's artwork, again... why? "},{"index":3,"type":"text","contents":"i don't know, i just like it. i've been obsessed with serial experiments lain since i first watched it, like, a year ago. i would've watched it much sooner than that if it weren't for this annoying habit i have of putting everything in my life off until i'm mentally 'ready' for it. this includes dishes and listening to albums and watching series/movies and so much more."},{"index":4,"type":"text","contents":"i think it's because i struggle to focus on these kinds of things. i have such stupidly bad ADHD, and until last year i had no idea what the hell was wrong with me. 23 years of thinking i was just a lazy, stupid piece of shit. well, all of that may be true, but at least i have an excuse for it now (lol)"},{"index":5,"type":"pic","contents":"cd1eace9-dc29-49a0-bcea-4d8b3e5d18db.jpg"},{"index":6,"type":"text","contents":"here's some artwork from the new EP i'm releasing, called “The Wired”"},{"index":7,"type":"text","contents":"i really wanted to finish the album off today, but i'm sick right now, probably from a cold. it sucks. this is a new year's tradition, though. every year i get very sick in winter. in 2019, it was covid (believe it or not, it was in england “far earlier than any of us could've imagined”, or so the politicians like to tell us. in 2020, i think i came down with a cold. i did again a couple times in 2021. then in 2022 i wasn't sick because i was in thailand (harder for colds to breed when you're in such a warm climate). in 2023, though, i got covid again and this time it really kicked my ass. i had to go to hospital because of dehydration - i couldn't drink water without it all coming back up, so to speak. so here we are, end of 2024/beginning of 2025 and lo and behold, the static girl is sick once again."},{"index":8,"type":"text","contents":"so instead of recording this last song (it's already partially recorded, anyway) let's talk about this new EP, 'The Wired'"},{"index":9,"type":"text","contents":"obviously, a central theme of this album is the concept of 'the wired', found in the series Serial Experiments Lain. i wanted to capture different feelings one might get from surfing the web, how such a task may range from total bliss to total degradation and filth. the internet is, to me, pandora's box. it has opened and has fucked over a lot of the world through its use under capitalism. just like any machine under the greater machine, it is built to advertise en masse, which can never benefit humanity (billionaires and oligarchs are subhuman). it is built to play into the devolution of mankind. mass complacency and distraction means we're all just numb enough to how terrible life is that we continue to play into the game of life and provide for the people at the top, all the while shooting down any ideas of another way as too progressive and ultimately unrealistic. 1984, a critique of 'communism', portrays a putrid world sickened by a surveillance state. here we are in the 21st century, we hear others mention this book all the time, but last i checked we (here in the west) don't live under a communist system. weird."},{"index":10,"type":"text","contents":"you'll find this sentiment shared among most artists, queers, and decent people in general. i wonder why that is. one for you nineteen for me and all that. "},{"index":11,"type":"text","contents":"tangents aside, serial experiments lain is a very good critique on the world wide web, and a harrowing, prophetic take on the ends to which the internet's means may lead. esotheric and weird, ultimately confusing and sombre, it's an anime i find myself recommending to friends and colleagues more often than any other (even Evangelion). any kind of media that's as subversive as this is what i generally find to be up my alley, whether it's a film by Eggers or Lynch. i hope my music can reflect this subversion, though i'm doubtful it succeeds in that, being that it's in a genre known for how repetitive it is... lol"},{"index":12,"type":"text","contents":"i hope you all have a great day. i'm going to try and get some more rest. i feel like fucking shit."},{"index":13,"type":"text","contents":"-static grrrl (written 07/01/25)"}]}