{"content":[{"index":0,"type":"text","contents":"And now! The moment you've ALL been waiting for! All... FOUR of you reading this!!"},{"index":1,"type":"text","contents":"A pictured, detailed tour of the little town my AC character calls home..."},{"index":2,"type":"text","contents":"OTARU!"},{"index":3,"type":"pic","contents":"eb047ec5-8ae9-4164-91f9-bec5fd8ef409.JPG"},{"index":4,"type":"text","contents":"(Photo taken 04/01/2019, not long after I first created the town in Dec, 2018)"},{"index":5,"type":"text","contents":"First we'll start wit ha smattering of photos from the early, developmental stages of Otaru's genesis. This photo above shows aurora borealis gleaming above the houses of two villagers, one of which I believe is Pietro, the sheep... or ram?-clown, the other... I'm not sure. Not much to be said here, other than this is near to where it all began. Why does it say 16/01 when the photo was taken 04/01? Time travel. Spooky..."},{"index":6,"type":"pic","contents":"3edd5210-4992-4ebc-b90d-2701ead95c5c.JPG"},{"index":7,"type":"text","contents":"In a sudden, major shift, only about a week later (though I'm sure many in-game weeks have passed at this point...), we can see early concepts of what the town would become have already begun to manifest, such as the signature pastel pathways and fairy-tale bridges that are now synonymous with 'Otaru'. What a nice photo, with a few favorite villagers: (pictured L2R) Broccoli, Punchy, Marcie and the ever-adored Bob."},{"index":8,"type":"pic","contents":"7d0d0667-20b6-4e4c-9466-9c4de753a7fc.JPG"},{"index":9,"type":"text","contents":"And in another very dramatic leap forward... taken on the 30th of January, 2019, even though it's already spring in game... we can see myself and Marcie sat on a bench together. This was a nice moment for me. I always loved Marcie. She's a very sweet, motherly villager and I was very depressed at the time of this town's making, so hearing her sweet and caring anecdotes often cheered me up. She's still here, in the village, to this day, as we'll see a bit later on."},{"index":10,"type":"pic","contents":"7376c4d9-1261-47ab-9e9b-e2ce153f6141.JPG"},{"index":11,"type":"text","contents":"(Taken 05/08/2019)<br>Reading this back then meant a lot to me. I remember my heart both soaring and sinking when I saw this text appear. Bonbon remains another favorite of mine, to this day, for this reason."},{"index":12,"type":"pic","contents":"a4d46d64-2f3c-4f99-ab9c-a0c1dfc5070f.JPG"},{"index":13,"type":"text","contents":"May 29th, 2019. A nice spring/summer day. Bob patrols the town as I get ready to sink my teeth into some fishing. Not too sure about the fashion sense here, if I can be honest. "},{"index":14,"type":"pic","contents":"00b0de6a-0587-4a95-bc29-d000337cc9a9.JPG"},{"index":15,"type":"text","contents":"Here's a lovely photo of Isabelle and I enjoying some beautiful, late-summer fireworks. Late summer here at the plaza, watching fireworks burst, seems oddly reminiscent to me of a summer-gone-by, something like 12 years ago. Funny how cyclical life can be."},{"index":16,"type":"pic","contents":"813184ca-c87b-4e2f-8841-02ed96ecb7a5.JPG"},{"index":17,"type":"text","contents":"Here's me, sat on a bench with Benjamin the dog, taken on the 18th of September, 2019. Autumn is approaching in-game. It's crazy to think, but this image was taken 3 days after I'd moved into my dorm at university. 2019 was a massive year in my life, for many reasons."},{"index":18,"type":"pic","contents":"9b766615-7310-475b-b458-76aa9e6b9259.JPG"},{"index":19,"type":"text","contents":"A little full-circle moment, here's Benjamin and Marcie both sat on the bench. How quaint. Taken on the 16th of December, 2019."},{"index":20,"type":"pic","contents":"edceb227-4d94-4dd0-850f-3988f168d089.JPG"},{"index":21,"type":"text","contents":"Here's a nice photo of my character standing underneath the arch that's just in front of my town center, in the midst of winter - in fact, on Christmas Eve, 2019."},{"index":22,"type":"pic","contents":"620e2ef2-93a2-444c-a5cf-6b9509d64c09.JPG"},{"index":23,"type":"text","contents":"My sister received a 3DS on Christmas Eve that year, so we played together. Another nice full-circle moment, considering she's the reason I started playing Animal Crossing to begin with."},{"index":24,"type":"pic","contents":"24deb85a-c683-449a-9e0a-634c79e5c88c.JPG"},{"index":25,"type":"pic","contents":"7e493186-4fd7-4f47-9258-5babbacdf922.JPG"},{"index":26,"type":"text","contents":"Taken five ten days apart, on the Fifth and Fifteenth of January, 2020, respectively. I don't know why Benjamin and Marcie like this bench so much. Ah, 2020, the year that dreaded 'Animal Crossing: New Horizons' came about. I was so hyped and then I was so, so disappointed. Those new horizons Nintendo went towards sure did suck major cock."},{"index":27,"type":"pic","contents":"b5789126-fc6c-46c3-a164-b3a0d053cbb5.JPG"},{"index":28,"type":"text","contents":"This picture was taken January 28th, 2024, just after I'd begun releasing regularly under 'static.grl', and just before I'd find a job in sales, which would eventually lead me to becoming a communist. Lol...<br>I guess I'd completed funding for this lighthouse the last time I'd played, however long ago that was (probably a couple years), which meant this time they held a little ceremony as usual. "},{"index":29,"type":"pic","contents":"fb0bff19-e32c-4b61-abd1-fa5ccf242a24.JPG"},{"index":30,"type":"text","contents":"Would you look at that? Bonbon on the bench. What's next, a lion?!"},{"index":31,"type":"pic","contents":"598f9275-6dbf-477c-bfa3-44872df66a22.JPG"},{"index":32,"type":"text","contents":"HOLY SHIT"},{"index":33,"type":"pic","contents":"abc102ef-c95e-4982-aa0d-ac240751c5cf.JPG"},{"index":34,"type":"text","contents":"Julian, one of the biggest meme villagers, gifts me THE meme item, which you'll see in my house a bit later."},{"index":35,"type":"text","contents":"That's all (except one) the photos I care to show you from before the tour, so without further adieu, here is a PROPER TOUR."},{"index":36,"type":"pic","contents":"fa5fad42-6ab4-4948-a016-c5e1dfa76b8b.JPG"},{"index":37,"type":"text","contents":"Welcome... to OTARU! Here's my character once again in all of her alt-chick glory, holding a kiki and lala wand. In the background you can see Bob and Ankha walking around. Ankha dutifully informed me that I had not spoken to her in 9 MONTHS. Which means the last time I played and spoke with her was April last year, probably while I was still in Aurora, CO... lol. Looks like a beautiful day today, so let's get EXPLORING!!!!!!!!!!111"},{"index":38,"type":"pic","contents":"c0f501bc-3527-45ac-b5c8-227f8514ca82.JPG"},{"index":39,"type":"text","contents":"(the aforementioned exception, contextualized now just after talking about Ankha. a favorite photo of mine)"},{"index":40,"type":"pic","contents":"9f3b936c-6514-4555-ba9f-39cb63361dd6.JPG"},{"index":41,"type":"text","contents":"Moving SWIFTLY on... here's that gate we saw earlier again, this time presented in daylight! The floral motif throughout is pink and white roses which compliment the pastel pathways something beautiful, if I say so myself. You can see a hint of the town flag's design which is meant to be an interpretation of Sonic Youth's 'Diamond Sea'. The Obsessive Sonic Youth Saga continues."},{"index":42,"type":"pic","contents":"765d2cca-5d6c-41dd-a957-19a434331a0c.JPG"},{"index":43,"type":"text","contents":"Here I am, showing off the beautiful sign to the city which I made years ago. I wanted to incorporate cherry blossoms because I was a filthy weeb - you'll see the full extent of my weebery in the house tour. Oh well, when in Rome... or, I don't know, the Kansai region."},{"index":44,"type":"pic","contents":"ce7cd344-1a9a-413a-bf4f-c47688163abb.JPG"},{"index":45,"type":"text","contents":"Here's a nice little area that's kind of the central highway of the town. To the right is my house, the townhall and the campsite with that slothful, sinning hippie. To the left is a residential area, the infamous bench that my villagers love so much, and my campground. And straight down will lead you across a bridge to the events plaza with my big ol' tree!"},{"index":46,"type":"pic","contents":"da245369-4479-47eb-b422-1d53e38cc857.JPG"},{"index":47,"type":"text","contents":"Here's me and Jerma on a date. Oh wait, wrong game. Shit."},{"index":48,"type":"pic","contents":"b344e1eb-1c68-4efd-9a1f-7faba8646ece.JPG"},{"index":49,"type":"text","contents":"Here's a sweet and snowy little Isabelle cut-out I got from one of those nifty, online QR codes (another fabulous addition), and in the back you can see a little water well and the aforementioned campground!"},{"index":50,"type":"pic","contents":"bc5183df-8e84-4103-88c1-01ce57c55378.JPG"},{"index":51,"type":"text","contents":"Here's Stone Henge. I will soon replace Stone Henge with an ominous, rotating black cube. "},{"index":52,"type":"pic","contents":"f4fd18ea-37c4-4daf-9b71-560bd3eac118.JPG"},{"index":53,"type":"text","contents":"Julian's story doesn't line up with Ankha's, so I can only assume I either ignored (unlikely) or completely missed a chance to speak with her when last I played. At least she hasn't up and left me."},{"index":54,"type":"pic","contents":"706fe579-56c6-4d00-be91-25fdba571f13.JPG"},{"index":55,"type":"text","contents":"Here's the tree at the plaza. Not much else to say."},{"index":56,"type":"pic","contents":"02b66598-76f6-41c7-97c7-7794efb7b924.JPG"},{"index":57,"type":"text","contents":"Just below this tree is a beautiful flower clock with a couple of Jacob's Ladders either side. And just below this clock is one of two inclines that leads to the beach!"},{"index":58,"type":"pic","contents":"6eb9603a-0b66-4827-8ac5-8a07858cdb66.JPG"},{"index":59,"type":"text","contents":"East of the plaza is a sort of botanical area, kind of like a public park or something, with a nice picnic blanket you would've seen my sister and I sat on earlier. Behind me is pictured a lovely fountain, and to my right is a police station (1312!!!!!!).  "},{"index":60,"type":"pic","contents":"47191665-ad68-41d1-a8f8-10c4c4f38a8e.JPG"},{"index":61,"type":"text","contents":"Here's Brewster's Cafe, a perfect addition to the botanical district. Stop for a coffee and stay for a while. I used to have a couple of villagers on this side of town but they've long since moved. A shame."},{"index":62,"type":"pic","contents":"a2131122-632e-4f88-ba72-68dc9ce184b9.JPG"},{"index":63,"type":"text","contents":"You think that's bad? Try living in a country that doesn't sell Cheez-Its. By the way, the way to my heart for those who wish to know, is cheez-its. I fucking love cheez-its. "},{"index":64,"type":"text","contents":"That's all I have to show off from the outside, but if you'd like to see the rest of my little shanty here, pray like the rest of us that Pretendo release their online functionality for ACNL sometime in the near future! That way I can give y'all my dreamsuite code! Anyways... let's move on to my house!"},{"index":65,"type":"pic","contents":"c24680ea-d7f0-4c67-92c3-9a0af0d0bf0f.JPG"},{"index":66,"type":"text","contents":"Mi casa he youkoso. This is the main room. Yes, it's weeby as all hell, but hey, the game gives you the option to make it weeby, so, my little weeb mind wanted to exercise that right to the full extent. Besides, there's touches of minimal and modern western influence in there. Although to be honest, this room looks awfully Ikea. Oh god. Anyways, you're welcomed by some nice trees, and you can see there's some groceries left on the table to give the room a 'lived-in' feel. Or something. I just thought they looked nice. In the back is a cocoa tree! Then there's some lilies of the valley next to a little statue that Gulliver sent me from Mexico. Moving on..."},{"index":67,"type":"pic","contents":"13ff5ae4-8adb-44a9-bd76-8383f0dbc5d2.JPG"},{"index":68,"type":"text","contents":"For those who aren't in the know (because why the fuck would you be?), my favorite fish, ever, is the Coelacanth. You'll see a few of them placed around. I keep 'em in my house because these little guys are just so cute and really interesting! I love you, Coelacanth. I always will, even if you're kind of a pain to catch. Part of the allure is how hard to get you play, my beloved. "},{"index":69,"type":"pic","contents":"d3361354-0c03-41f4-b1d3-25ba3f46a0e2.JPG"},{"index":70,"type":"text","contents":"This is the kitchen! The weebery continues (gag me with a spoon). It's just a kitchen like you'd see in one of my Japanese animes. There's some cup noodles, homework, letters being written, and a nice vintage Stereo playing K.K. Disco (so good). "},{"index":71,"type":"pic","contents":"e1cf3251-872a-4311-8d85-db0045533815.JPG"},{"index":72,"type":"text","contents":"I guess she's making some peppermint tea, because that's the only tea I drink, really. "},{"index":73,"type":"pic","contents":"d70ae2bd-8408-4b76-9ff2-95c0b5b23af3.JPG"},{"index":74,"type":"text","contents":"Here's my meditation/garden/I'm sorry I was such a fucking dumb weeb room! I always liked this idea of having an indoor garden. I used to include them all the time in my Minecraft houses that I built as a child, now here it is reflected in Animal Crossing. There's a Tanuki with fat fucking balls in the corner."},{"index":75,"type":"pic","contents":"342b173e-417f-4fdf-a288-a11b9389afb6.JPG"},{"index":76,"type":"text","contents":"Here's my laundry/chore/I don't really know what I'm doing room, with a freezer, a couple washers, a washer/drier, toilet, sink, and the elusive fan favorite froggy chair. This is, in fact, the very same froggy chair gifted to me by Julian."},{"index":77,"type":"pic","contents":"31d31025-d8ff-4fdd-8e9d-6b1606a8a162.JPG"},{"index":78,"type":"text","contents":"'Mary... could you really be in this town?'<br>That pink garb looks awfully familiar, like something some kind of vampire who fights shrine maidens would wear."},{"index":79,"type":"pic","contents":"0421c182-5b5a-4f00-a83b-a83abdb2aa84.JPG"},{"index":80,"type":"text","contents":"And here's the basement, which kind of doubles as my bedroom. There's some bookshelves, a couple of knight statues for some reason, a harp, harpsichord, guitar... also a bunch of miscellanious Rococo furniture, the set of which I've yet to complete but am desperate to."},{"index":81,"type":"pic","contents":"5bf0ec5d-4dbc-43fa-98d6-a45f8d75cdc9.JPG"},{"index":82,"type":"text","contents":"Another view of the room, revealing another beloved Coelacanth. "},{"index":83,"type":"pic","contents":"b698756a-69d6-4a3a-bacf-2cb5108dfec0.JPG"},{"index":84,"type":"text","contents":"Here's the attic, which is another array of miscellanious furniture. I tried to complete the Alpine set and almost did, and then I kind of fell out of love with it, but I still had all the parts and didn't really know what to do with it, so it remains here for the time being. Eventually I'll change this room into an upstairs office and flesh it out plenty, but for now it's just uh, a room."},{"index":85,"type":"pic","contents":"1e24b043-0a30-43bb-95a9-dc31c377215b.JPG"},{"index":86,"type":"text","contents":"Here I am, a girl online, making beats for my fellow girlies. Yay!"},{"index":87,"type":"pic","contents":"29559117-3153-4e83-9ad7-807ffeef3a64.JPG"},{"index":88,"type":"text","contents":"And that concludes my grand tour of Otaru! I hope you all enjoyed looking around my little village, and I hope even more that you'll come visit me via the dream suite when Pretendo provides functionality for ACNL!<br>Lots of love to all of you out there on the web. Have a good one!"},{"index":89,"type":"text","contents":"- static.grl"}]}